Конфигурация/Documents/НесоответствиеИнвестиционнойДекларации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>НесоответствиеИнвестиционнойДекларации</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.НесоответствияИнвестиционнымДекларациям</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнвестиционнаяДекларация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнвестиционныеДекларации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСтрокиПоказателей</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатыКонтроляИнвестиционнойДекларации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстранения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговораДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставНабора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидАктива</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Актив</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВалютныеПары</v8:Type>
								<v8:Type>cfg:CatalogRef.Векселя</v8:Type>
								<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
								<v8:Type>cfg:CatalogRef.ВидыЗадолженности</v8:Type>
								<v8:Type>cfg:CatalogRef.ПроизводныеФинансовыеИнструменты</v8:Type>
								<v8:Type>cfg:CatalogRef.Паи</v8:Type>
								<v8:Type>cfg:CatalogRef.ДепозитарныеРасписки</v8:Type>
								<v8:Type>cfg:CatalogRef.Доли</v8:Type>
								<v8:Type>cfg:CatalogRef.Закладные</v8:Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
								<v8:Type>cfg:CatalogRef.ИпотечныеСертификатыУчастия</v8:Type>
								<v8:Type>cfg:CatalogRef.ДепозитныеВклады</v8:Type>
								<v8:Type>cfg:CatalogRef.Акции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоследнейПокупки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
								<v8:Type>cfg:CatalogRef.Паи</v8:Type>
								<v8:Type>cfg:CatalogRef.ДепозитарныеРасписки</v8:Type>
								<v8:Type>cfg:CatalogRef.Доли</v8:Type>
								<v8:Type>cfg:CatalogRef.ИпотечныеСертификатыУчастия</v8:Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
								<v8:Type>cfg:CatalogRef.Акции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДоверительногоУправления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Классификация</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Enums/ТипыИнвестиционныхДеклараций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыИнвестиционныхДеклараций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ИнвестиционнаяДекларация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛимитнаяВедомость</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаконодательныеОграничения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/НесоответствиеИнвестиционнойДекларации/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтаФорма,,, Отказ) Тогда
		Возврат;
	КонецЕсли;

	Если Не Параметры.ЗначенияЗаполнения.Свойство("ИдентификаторСтрокиПоказателей")
		И Параметры.Ключ.Пустая() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Документ можно создавать только из обработки Контроль инвестиционных деклараций",,,, Отказ); 
	КонецЕсли; 
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если УниверсальныеМеханизмы.ФормаСоздана(ЭтаФорма) Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
КонецПроцедуры

#КонецОбласти 

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	УниверсальныеМеханизмы.УстановитьЗаголовокФормы(ЭтаФорма);
	
	Если ЗначениеЗаполнено(Объект.ИнвестиционнаяДекларация) И ЗначениеЗаполнено(Объект.ИдентификаторСтрокиПоказателей) Тогда
		
		ТекстЗапроса = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ИнвестиционныеДекларацииПоказатели.НомерСтроки КАК НомерСтроки,
			|	ИнвестиционныеДекларацииПоказатели.Базис КАК Базис,
			|	ИнвестиционныеДекларацииПоказатели.КонтролируемыйПоказатель КАК КонтролируемыйПоказатель,
			|	ИнвестиционныеДекларацииПоказатели.МинимальноеЗначение КАК МинимальноеЗначение,
			|	ИнвестиционныеДекларацииПоказатели.МаксимальноеЗначение КАК МаксимальноеЗначение,
			|	ИнвестиционныеДекларацииПоказатели.АбсолютнаяВеличинаМин КАК АбсолютнаяВеличинаМин,
			|	ИнвестиционныеДекларацииПоказатели.АбсолютнаяВеличинаМакс КАК АбсолютнаяВеличинаМакс,
			|	ИнвестиционныеДекларацииПоказатели.ОбъединятьОтборы КАК ОбъединятьОтборы,
			|	ИнвестиционныеДекларацииПоказатели.НаборИнвестиционнойДекларации КАК НаборИнвестиционнойДекларации,
			|	ИнвестиционныеДекларацииПоказатели.ВнутреннийНабор КАК ВнутреннийНабор,
			|	ИнвестиционныеДекларацииПоказатели.ОпределяетСоставИСтруктуру КАК ОпределяетСоставИСтруктуру,
			|	ИнвестиционныеДекларацииПоказатели.Эмитент КАК Эмитент,
			|	ИнвестиционныеДекларацииПоказатели.ВключаяФилиалы КАК ВключаяФилиалы,
			|	ИнвестиционныеДекларацииПоказатели.ЦеннаяБумага КАК ЦеннаяБумага,
			|	ЕСТЬNULL(ИнвестиционныеДекларацииГруппыЦенныхБумаг.Имя, """") КАК ГруппаЦенныхБумаг,
			|	ЕСТЬNULL(ИнвестиционныеДекларацииГруппыЭмитентов.Имя, """") КАК ГруппаЭмитентов
			|ИЗ
			|	Справочник.ИнвестиционныеДекларации.Показатели КАК ИнвестиционныеДекларацииПоказатели
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИнвестиционныеДекларации.ГруппыЭмитентов КАК ИнвестиционныеДекларацииГруппыЭмитентов
			|		ПО ИнвестиционныеДекларацииПоказатели.Ссылка = ИнвестиционныеДекларацииГруппыЭмитентов.Ссылка
			|			И ИнвестиционныеДекларацииПоказатели.ГруппаЭмитентов = ИнвестиционныеДекларацииГруппыЭмитентов.Идентификатор
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИнвестиционныеДекларации.ГруппыЦенныхБумаг КАК ИнвестиционныеДекларацииГруппыЦенныхБумаг
			|		ПО ИнвестиционныеДекларацииПоказатели.Ссылка = ИнвестиционныеДекларацииГруппыЦенныхБумаг.Ссылка
			|			И ИнвестиционныеДекларацииПоказатели.ГруппаЦенныхБумаг = ИнвестиционныеДекларацииГруппыЦенныхБумаг.Идентификатор
			|ГДЕ
			|	ИнвестиционныеДекларацииПоказатели.Ссылка = &Ссылка
			|	И ИнвестиционныеДекларацииПоказатели.ИдентификаторСтрокиПоказателей = &ИдентификаторСтрокиПоказателей";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Ссылка", Объект.ИнвестиционнаяДекларация);
		Запрос.УстановитьПараметр("ИдентификаторСтрокиПоказателей", Объект.ИдентификаторСтрокиПоказателей);
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Если Выборка.Следующий() Тогда
		
			Элементы.ГруппаСтрокаИД.Заголовок = "Строка ИД №" + Выборка.НомерСтроки;
			ЭтаФорма.Набор = Выборка.НаборИнвестиционнойДекларации;
			
			Если ЗначениеЗаполнено(Выборка.Эмитент) Или ЗначениеЗаполнено(Выборка.ГруппаЭмитентов) Тогда
				ЭтаФорма.ОтборПоЭмитенту = ?(ЗначениеЗаполнено(Выборка.Эмитент), Строка(Выборка.Эмитент), "Группа " + Выборка.ГруппаЭмитентов) 
					+ ?(Выборка.ВключаяФилиалы, ", включая филиалы", "");
			Иначе
				ЭтаФорма.ОтборПоЭмитенту = "Не установлен";
			КонецЕсли; 
			
			Если ЗначениеЗаполнено(Выборка.ЦеннаяБумага) Или ЗначениеЗаполнено(Выборка.ГруппаЦенныхБумаг) Тогда
				ЭтаФорма.ОтборПоЦеннойБумаге = ?(ЗначениеЗаполнено(Выборка.ЦеннаяБумага), Строка(Выборка.ЦеннаяБумага), "Группа " + Выборка.ГруппаЦенныхБумаг);
			Иначе
				ЭтаФорма.ОтборПоЦеннойБумаге = "Не установлен";
			КонецЕсли; 
			
			МассивОграничений = Новый Массив;
			
			МассивОграничений.Добавить(Выборка.КонтролируемыйПоказатель);
			
			Если Выборка.МинимальноеЗначение > 0 Тогда
				Если Выборка.МаксимальноеЗначение > 0 Тогда
					ПодстрокаОт = "от ";
				Иначе
					ПодстрокаОт = "не менее ";
				КонецЕсли;
				МассивОграничений.Добавить(ПодстрокаОт + Выборка.МинимальноеЗначение + ?(Выборка.АбсолютнаяВеличинаМин, "", "%"));
			КонецЕсли; 
			
			Если Выборка.МаксимальноеЗначение = 0 И Не Выборка.АбсолютнаяВеличинаМакс Тогда
				МассивОграничений.Добавить("равна нулю");
			ИначеЕсли Выборка.МаксимальноеЗначение > 0 Тогда 
				Если Выборка.МинимальноеЗначение > 0 Тогда
					ПодстрокаДо = "до ";
				Иначе
					ПодстрокаДо = "не более ";
				КонецЕсли; 
				МассивОграничений.Добавить(ПодстрокаДо + Выборка.МаксимальноеЗначение + ?(Выборка.АбсолютнаяВеличинаМакс, "", "%"));
			КонецЕсли;
			
			Если Не (Выборка.АбсолютнаяВеличинаМин И Выборка.АбсолютнаяВеличинаМакс) Тогда
				МассивОграничений.Добавить("от базы '" + Выборка.Базис + "'");
			КонецЕсли; 
			
			ЭтаФорма.Ограничения = СтрСоединить(МассивОграничений, " ");
		
		КонецЕсли;
				
		ТаблицаПоказателей = Справочники.БазисыКонтроляИнвестиционныхДеклараций.ПолучитьОписаниеКонтролируемыхПоказателей(Выборка.Базис.НаборДанных);
		Показатель = ТаблицаПоказателей.Найти(Выборка.КонтролируемыйПоказатель, "Представление");
		Элементы.СоставНабораГруппа.Видимость = (Показатель.ГруппировкаСтруктуры <> "Служебные.ОбщийИтог");
		
		ТипИД = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ИнвестиционнаяДекларация, "ТипИнвестиционнойДекларации");
		СовокупныйКонтроль = (ТипИД <> Перечисления.ТипыИнвестиционныхДеклараций.ИнвестиционнаяДекларация);
		
		Элементы.СоставНабораСчетДоверительногоУправления.Видимость = СовокупныйКонтроль;
			
	КонецЕсли; 
	
КонецПроцедуры


&НаКлиенте
Процедура ИнвестиционнаяДекларацияОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Форма = ПолучитьФорму("Справочник.ИнвестиционныеДекларации.Форма.ФормаЭлемента", Новый Структура("Ключ", Объект.ИнвестиционнаяДекларация), Элемент, ЭтаФорма);
	НайденныеСтроки = Форма.Объект.Показатели.НайтиСтроки(Новый Структура("ИдентификаторСтрокиПоказателей", Объект.ИдентификаторСтрокиПоказателей));
	
	Если Форма.Открыта() Тогда
	    Форма.Активизировать();
	Иначе
		Форма.Открыть();
	КонецЕсли; 
	
	Если НайденныеСтроки.Количество() = 1 Тогда
		Форма.Элементы.Показатели.ТекущаяСтрока = НайденныеСтроки[0].ПолучитьИдентификатор();
	КонецЕсли; 
	
КонецПроцедуры
